MacOSX13.1.sdk/usr/share/man/man8/networkQuality.8
.\" Copyright (c) 2020-2022 Apple Computer, Inc.  All rights reserved.
.Dd 9/22/20
.Dt networkQuality 8
.Os Darwin
.Sh NAME
.Nm networkQuality
.Nd Network quality testing tool
.Sh SYNOPSIS
.Nm
.Op Fl chksv          \" [-chksv]
.Op Fl C Ar configuration URL \" [-C configuration URL]
.Op Fl I Ar interface \" [-I interface]
.Op Fl r Ar host \" [-r host]
.Sh DESCRIPTION
.Nm
allows for measuring the different aspects of Network Quality, including:
.Pp
Maximal capacity (often described as speed)
.Pp
The responsiveness of the connection. Responsiveness measures the quality of your network by the number of roundtrips completed per minute (RPM) under working conditions. See
.Ar https://support.apple.com/kb/HT212313
.Pp
Other aspects of the connection that affect the quality of experience.
.Pp
NOTE: This tool will connect to the Internet to perform its tests. This will use data on your Internet service plan.
.Pp
For more details about the RPM score and the methodology around the testing, see
.Ar https://datatracker.ietf.org/doc/draft-cpaasch-ippm-responsiveness/
.Pp
The following options are available:
.Bl -tag -width -indent
.It Fl C Ar configuration URL/path
Use custom configuration URL or path (with scheme file://). See
.Ar https://github.com/network-quality/server
for server implementation details.
.It Fl I Ar interface
Bind test to interface (e.g., en0, pdp_ip0,...)
.Pp
If not specified, the default interface will be used.
.It Fl r Ar host
Connect to host or IP, overriding DNS for initial config request
.It Fl c
Produce computer-readable output.
.It Fl h
Show help
.It Fl k
Disable verification of the server identity via TLS.
.It Fl s
Run tests sequentially instead of parallel upload/download.
.It Fl v
Verbose output.
.El                      \" Ends the list
.Pp
.\" .El
.Sh SEE ALSO
.\" List links in ascending order by section, alphabetically within a section.
.\" Please do not reference files that do not exist without filing a bug report
.Xr ping 8 ,
.Xr traceroute 8
.\" .Sh BUGS              \" Document known, unremedied bugs
.\" .Sh HISTORY           \" Document history if command behaves in a unique manner
