MacOSX10.12.sdk/usr/share/man/man8/AssetCacheActivatorUtil.8
.\"Modified from man(1) of FreeBSD, the NetBSD mdoc.template, and mdoc.samples.
.\"See Also:
.\"man mdoc.samples for a complete listing of options
.\"man mdoc for the short list of editing options
.\"/usr/share/misc/mdoc.template
.Dd 10/24/16               \" DATE 
.Dt AssetCacheActivatorUtil 8      \" Program name and manual section number 
.Os "macOS"
.Sh NAME                 \" Section Header - required - don't modify 
.Nm AssetCacheActivatorUtil
.\" The following lines are read in generating the apropos(man -k) database. Use only key
.\" words here as the database is built based on the words here and in the .ND line. 
.\" .Nm Other_name_for_same_program(),
.\" .Nm Yet another name for the same program.
.\" Use .Nm macro to designate other names for the documented program.
.Nd control the macOS caching server
.Sh SYNOPSIS             \" Section Header - required - don't modify
.Nm
.Ar activate
.Nm
.Ar deactivate
.Nm
.Ar isActivated
.Nm
.Ar canActivate
.Nm
.Ar status
.Sh DESCRIPTION          \" Section Header - required - don't modify
The caching server built-in to macOS is deactivated by default.
In its first three forms,
.Nm
activates the built-in caching server, deactivates it, or reports its activation status.
In its fourth form,
.Nm
reports whether the built-in caching server is eligible for activation.
Installing macOS Server prevents the built-in caching server from activating.
In its fifth form,
.Nm
reports the built-in caching server's status.
.Sh "SEE ALSO"
.Ns Xr AssetCache 8 ,
.Ns Xr AssetCacheLocatorUtil 8 ,
.Ns Xr AssetCacheTetheratorUtil 8
