MacOSX26.5.sdk/usr/share/man/man8/xprotectd.8
.\"Modified from man(1) of FreeBSD, the NetBSD mdoc.template, and mdoc.samples.
.\"See Also:
.\"man mdoc.samples for a complete listing of options
.\"man mdoc for the short list of editing options
.\"/usr/share/misc/mdoc.template
.Dd December 9th, 2025
.Dt xprotectd 8         \" Program name and manual section number
.Os Darwin
.Sh NAME                 \" Section Header - required - don't modify
.Nm xprotectd
.\" The following lines are read in generating the apropos(man -k) database. Use only key
.\" words here as the database is built based on the words here and in the .ND line.
.Nd XProtect Daemon
.Sh SYNOPSIS             \" Section Header - required - don't modify
.Nm
.Op Fl v
.Sh DESCRIPTION          \" Section Header - required - don't modify
.Nm
is a subsystem of XProtect, a component of MacOS which automatically detects and blocks the execution of known malware.
.Pp
.Sh FILES                \" File used or created by the topic of the man page
.Bl -tag -width "/System/Library/LaunchDaemons/com.apple.security.xprotectd.plist" -compact
.It Pa /System/Library/LaunchDaemons/com.apple.security.xprotectd.plist
The launchd.plist(5) for xprotectd.
.El                      \" Ends the list
.Sh SEE ALSO
.Xr securityd 8 ,
.Xr endpointsecurityd 8 ,
.\" .Sh BUGS              \" Document known, unremedied bugs
.\" .Sh HISTORY           \" Document history if command behaves in a unique manner
