MacOSX10.15.sdk/usr/share/man/man8/diagnosticd.8
.Dd 2018-08-30
.Dt diagnosticd 8
.Os Darwin
.Sh NAME
.Nm diagnosticd
.Nd unified logging system diagnostic daemon
.Sh DESCRIPTION
.Nm
is part of the unified logging system.
It helps serve live debugging information.
For example, it manages and delivers data to Console.app and the
.Xr log 1
utility's
.Cm stream
command.
.Bd -literal -offset indent
{ process }
     `--- os_log ---> ... { logd } ...
               \\
                `---> { diagnosticd } ---> { Console.app }
                                      `---> { log stream }
.Ed
.Pp
Note that, when Console.app or
.Cm "log stream"
are actively displaying ongoing system data,
.Nm
and
.Xr os_log 3
calls require extra system resources (e.g., CPU) to serve this data live.
.Sh SEE ALSO
.Xr log 1 ,
.Xr os_log 3 ,
.Xr logd 8
.Pp
.Lk https://developer.apple.com/documentation/os/logging "Logging | Apple Developer Documentation"
